GopalSaraf/Practicals/PSDL/include/proc/pic18f66j50.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0FB8h

// Register: ECCP2DEL
#define ECCP2DEL ECCP2DEL
ECCP2DEL                                 equ 0FB9h
// bitfield definitions
ECCP2DEL_PDC_POSN                        equ 0000h
ECCP2DEL_PDC_POSITION                    equ 0000h
ECCP2DEL_PDC_SIZE                        equ 0007h
ECCP2DEL_PDC_LENGTH                      equ 0007h
ECCP2DEL_PDC_MASK                        equ 007Fh
ECCP2DEL_PRSEN_POSN                      equ 0007h
ECCP2DEL_PRSEN_POSITION                  equ 0007h
ECCP2DEL_PRSEN_SIZE                      equ 0001h
ECCP2DEL_PRSEN_LENGTH                    equ 0001h
ECCP2DEL_PRSEN_MASK                      equ 0080h
ECCP2DEL_PDC0_POSN                       equ 0000h
ECCP2DEL_PDC0_POSITION                   equ 0000h
ECCP2DEL_PDC0_SIZE                       equ 0001h
ECCP2DEL_PDC0_LENGTH                     equ 0001h
ECCP2DEL_PDC0_MASK                       equ 0001h
ECCP2DEL_PDC1_POSN                       equ 0001h
ECCP2DEL_PDC1_POSITION                   equ 0001h
ECCP2DEL_PDC1_SIZE                       equ 0001h
ECCP2DEL_PDC1_LENGTH                     equ 0001h
ECCP2DEL_PDC1_MASK                       equ 0002h
ECCP2DEL_PDC2_POSN                       equ 0002h
ECCP2DEL_PDC2_POSITION                   equ 0002h
ECCP2DEL_PDC2_SIZE                       equ 0001h
ECCP2DEL_PDC2_LENGTH                     equ 0001h
ECCP2DEL_PDC2_MASK                       equ 0004h
ECCP2DEL_PDC3_POSN                       equ 0003h
ECCP2DEL_PDC3_POSITION                   equ 0003h
ECCP2DEL_PDC3_SIZE                       equ 0001h
ECCP2DEL_PDC3_LENGTH                     equ 0001h
ECCP2DEL_PDC3_MASK                       equ 0008h
ECCP2DEL_PDC4_POSN                       equ 0004h
ECCP2DEL_PDC4_POSITION                   equ 0004h
ECCP2DEL_PDC4_SIZE                       equ 0001h
ECCP2DEL_PDC4_LENGTH                     equ 0001h
ECCP2DEL_PDC4_MASK                       equ 0010h
ECCP2DEL_PDC5_POSN                       equ 0005h
ECCP2DEL_PDC5_POSITION                   equ 0005h
ECCP2DEL_PDC5_SIZE                       equ 0001h
ECCP2DEL_PDC5_LENGTH                     equ 0001h
ECCP2DEL_PDC5_MASK                       equ 0020h
ECCP2DEL_PDC6_POSN                       equ 0006h
ECCP2DEL_PDC6_POSITION                   equ 0006h
ECCP2DEL_PDC6_SIZE                       equ 0001h
ECCP2DEL_PDC6_LENGTH                     equ 0001h
ECCP2DEL_PDC6_MASK                       equ 0040h
ECCP2DEL_P2DC0_POSN                      equ 0000h
ECCP2DEL_P2DC0_POSITION                  equ 0000h
ECCP2DEL_P2DC0_SIZE                      equ 0001h
ECCP2DEL_P2DC0_LENGTH                    equ 0001h
ECCP2DEL_P2DC0_MASK                      equ 0001h
ECCP2DEL_P2DC1_POSN                      equ 0001h
ECCP2DEL_P2DC1_POSITION                  equ 0001h
ECCP2DEL_P2DC1_SIZE                      equ 0001h
ECCP2DEL_P2DC1_LENGTH                    equ 0001h
ECCP2DEL_P2DC1_MASK                      equ 0002h
ECCP2DEL_P2DC2_POSN                      equ 0002h
ECCP2DEL_P2DC2_POSITION                  equ 0002h
ECCP2DEL_P2DC2_SIZE                      equ 0001h
ECCP2DEL_P2DC2_LENGTH                    equ 0001h
ECCP2DEL_P2DC2_MASK                      equ 0004h
ECCP2DEL_P2DC3_POSN                      equ 0003h
ECCP2DEL_P2DC3_POSITION                  equ 0003h
ECCP2DEL_P2DC3_SIZE                      equ 0001h
ECCP2DEL_P2DC3_LENGTH                    equ 0001h
ECCP2DEL_P2DC3_MASK                      equ 0008h
ECCP2DEL_P2DC4_POSN                      equ 0004h
ECCP2DEL_P2DC4_POSITION                  equ 0004h
ECCP2DEL_P2DC4_SIZE                      equ 0001h
ECCP2DEL_P2DC4_LENGTH                    equ 0001h
ECCP2DEL_P2DC4_MASK                      equ 0010h
ECCP2DEL_P2DC5_POSN                      equ 0005h
ECCP2DEL_P2DC5_POSITION                  equ 0005h
ECCP2DEL_P2DC5_SIZE                      equ 0001h
ECCP2DEL_P2DC5_LENGTH                    equ 0001h
ECCP2DEL_P2DC5_MASK                      equ 0020h
ECCP2DEL_P2DC6_POSN                      equ 0006h
ECCP2DEL_P2DC6_POSITION                  equ 0006h
ECCP2DEL_P2DC6_SIZE                      equ 0001h
ECCP2DEL_P2DC6_LENGTH                    equ 0001h
ECCP2DEL_P2DC6_MASK                      equ 0040h
ECCP2DEL_P2RSEN_POSN                     equ 0007h
ECCP2DEL_P2RSEN_POSITION                 equ 0007h
ECCP2DEL_P2RSEN_SIZE                     equ 0001h
ECCP2DEL_P2RSEN_LENGTH                   equ 0001h
ECCP2DEL_P2RSEN_MASK                     equ 0080h

// Register: ECCP2AS
#define ECCP2AS ECCP2AS
ECCP2AS                                  equ 0FBAh
// bitfield definitions
ECCP2AS_PSSBD_POSN                       equ 0000h
ECCP2AS_PSSBD_POSITION                   equ 0000h
ECCP2AS_PSSBD_SIZE                       equ 0002h
ECCP2AS_PSSBD_LENGTH                     equ 0002h
ECCP2AS_PSSBD_MASK                       equ 0003h
ECCP2AS_PSSAC_POSN                       equ 0002h
ECCP2AS_PSSAC_POSITION                   equ 0002h
ECCP2AS_PSSAC_SIZE                       equ 0002h
ECCP2AS_PSSAC_LENGTH                     equ 0002h
ECCP2AS_PSSAC_MASK                       equ 000Ch
ECCP2AS_ECCPAS_POSN                      equ 0004h
ECCP2AS_ECCPAS_POSITION                  equ 0004h
ECCP2AS_ECCPAS_SIZE                      equ 0003h
ECCP2AS_ECCPAS_LENGTH                    equ 0003h
ECCP2AS_ECCPAS_MASK                      equ 0070h
ECCP2AS_ECCPASE_POSN                     equ 0007h
ECCP2AS_ECCPASE_POSITION                 equ 0007h
ECCP2AS_ECCPASE_SIZE                     equ 0001h
ECCP2AS_ECCPASE_LENGTH                   equ 0001h
ECCP2AS_ECCPASE_MASK                     equ 0080h
ECCP2AS_PSSBD0_POSN                      equ 0000h
ECCP2AS_PSSBD0_POSITION                  equ 0000h
ECCP2AS_PSSBD0_SIZE                      equ 0001h
ECCP2AS_PSSBD0_LENGTH                    equ 0001h
ECCP2AS_PSSBD0_MASK                      equ 0001h
ECCP2AS_PSSBD1_POSN                      equ 0001h
ECCP2AS_PSSBD1_POSITION                  equ 0001h
ECCP2AS_PSSBD1_SIZE                      equ 0001h
ECCP2AS_PSSBD1_LENGTH                    equ 0001h
ECCP2AS_PSSBD1_MASK                      equ 0002h
ECCP2AS_PSSAC0_POSN                      equ 0002h
ECCP2AS_PSSAC0_POSITION                  equ 0002h
ECCP2AS_PSSAC0_SIZE                      equ 0001h
ECCP2AS_PSSAC0_LENGTH                    equ 0001h
ECCP2AS_PSSAC0_MASK                      equ 0004h
ECCP2AS_PSSAC1_POSN                      equ 0003h
ECCP2AS_PSSAC1_POSITION                  equ 0003h
ECCP2AS_PSSAC1_SIZE                      equ 0001h
ECCP2AS_PSSAC1_LENGTH                    equ 0001h
ECCP2AS_PSSAC1_MASK                      equ 0008h
ECCP2AS_ECCPAS0_POSN                     equ 0004h
ECCP2AS_ECCPAS0_POSITION                 equ 0004h
ECCP2AS_ECCPAS0_SIZE                     equ 0001h
ECCP2AS_ECCPAS0_LENGTH                   equ 0001h
ECCP2AS_ECCPAS0_MASK                     equ 0010h
ECCP2AS_ECCPAS1_POSN                     equ 0005h
ECCP2AS_ECCPAS1_POSITION                 equ 0005h
ECCP2AS_ECCPAS1_SIZE                     equ 0001h
ECCP2AS_ECCPAS1_LENGTH                   equ 0001h
ECCP2AS_ECCPAS1_MASK                     equ 0020h
ECCP2AS_ECCPAS2_POSN                     equ 0006h
ECCP2AS_ECCPAS2_POSITION                 equ 0006h
ECCP2AS_ECCPAS2_SIZE                     equ 0001h
ECCP2AS_ECCPAS2_LENGTH                   equ 0001h
ECCP2AS_ECCPAS2_MASK                     equ 0040h
ECCP2AS_PSS2BD0_POSN                     equ 0000h
ECCP2AS_PSS2BD0_POSITION                 equ 0000h
ECCP2AS_PSS2BD0_SIZE                     equ 0001h
ECCP2AS_PSS2BD0_LENGTH                   equ 0001h
ECCP2AS_PSS2BD0_MASK                     equ 0001h
ECCP2AS_PSS2BD1_POSN                     equ 0001h
ECCP2AS_PSS2BD1_POSITION                 equ 0001h
ECCP2AS_PSS2BD1_SIZE                     equ 0001h
ECCP2AS_PSS2BD1_LENGTH                   equ 0001h
ECCP2AS_PSS2BD1_MASK                     equ 0002h
ECCP2AS_PSS2AC0_POSN                     equ 0002h
ECCP2AS_PSS2AC0_POSITION                 equ 0002h
ECCP2AS_PSS2AC0_SIZE                     equ 0001h
ECCP2AS_PSS2AC0_LENGTH                   equ 0001h
ECCP2AS_PSS2AC0_MASK                     equ 0004h
ECCP2AS_PSS2AC1_POSN                     equ 0003h
ECCP2AS_PSS2AC1_POSITION                 equ 0003h
ECCP2AS_PSS2AC1_SIZE                     equ 0001h
ECCP2AS_PSS2AC1_LENGTH                   equ 0001h
ECCP2AS_PSS2AC1_MASK                     equ 0008h
ECCP2AS_ECCP2AS0_POSN                    equ 0004h
ECCP2AS_ECCP2AS0_POSITION                equ 0004h
ECCP2AS_ECCP2AS0_SIZE                    equ 0001h
ECCP2AS_ECCP2AS0_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS0_MASK                    equ 0010h
ECCP2AS_ECCP2AS1_POSN                    equ 0005h
ECCP2AS_ECCP2AS1_POSITION                equ 0005h
ECCP2AS_ECCP2AS1_SIZE                    equ 0001h
ECCP2AS_ECCP2AS1_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS1_MASK                    equ 0020h
ECCP2AS_ECCP2AS2_POSN                    equ 0006h
ECCP2AS_ECCP2AS2_POSITION                equ 0006h
ECCP2AS_ECCP2AS2_SIZE                    equ 0001h
ECCP2AS_ECCP2AS2_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS2_MASK                    equ 0040h
ECCP2AS_ECCP2ASE_POSN                    equ 0007h
ECCP2AS_ECCP2ASE_POSITION                equ 0007h
ECCP2AS_ECCP2ASE_SIZE                    equ 0001h
ECCP2AS_ECCP2ASE_LENGTH                  equ 0001h
ECCP2AS_ECCP2ASE_MASK                    equ 0080h

